УТ_для_edt/src/Documents/смартКорректировкаКоэффициентовМенеджеров/смартКорректировкаКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартКорректировкаКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 04.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКоэффициента</name>
    <type>
      <types>EnumRef.смартВидыКоэффициентовМенеджеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Менеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтВыручки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтКонверсии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтПотериЛидов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтКоммерческогоОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтМаркетинговогоОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартВидыКоэффициентовМенеджеров/смартВидыКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 07.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <enumValues>
    <name>ИтоговыйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКонверсии</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтПотериЛидов</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтМаркетинговогоОтдела</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартКорректировкаКоэффициентовМенеджеров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	Менеджеры.Очистить();	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, Режим);
	//
	//Документы.смартКорректировкаКоэффициентовМенеджеров.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//ОтразитьСмартКоэффициентыМенеджеров(ДополнительныеСвойства, Движения, Отказ);
	//
	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОтразитьСмартКоэффициентыМенеджеров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	//Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСмартКоэффициентыМенеджеров;
	//
	//Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДвиженияСмартКоэффициентыМенеджеров = Движения.смартКоэффициентыМенеджеров;
	//ДвиженияСмартКоэффициентыМенеджеров.Записывать = Истина;
	//
	//ДвиженияСмартКоэффициентыМенеджеров.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Дата=ТекущаяДата();
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	ВидКоэффициента=Перечисления.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Менеджеры.Количество()=0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ не содержит строк!");
		Отказ=Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
